app/Views/front-end/v_peserta_qurban.php

                                    </tr>
                                    <?php
                                    $db = \Config\Database::connect();
                                    $peserta = $db->table('tbl_peserta_kelompok')
                                        ->where('id_kelompok', $value['id_kelompok'])
                                        ->get()->getResultArray();
                                    $no = 1;

                                    foreach ($peserta as $key => $peserta) {
                                        $biaya = $db->table('tbl_peserta_kelompok')
                                            ->where('id_kelompok', $peserta['id_kelompok'])
                                            ->select('tbl_peserta_kelompok.id_kelompok')
                                            ->groupBy('tbl_peserta_kelompok.id_kelompok')
                                            ->selectSum('tbl_peserta_kelompok.biaya')
                                            ->get()->getRowArray();
---
SELECT *
FROM `tbl_peserta_kelompok`
WHERE `id_kelompok` = '1'
SELECT `tbl_peserta_kelompok`.`id_kelompok`, SUM(`tbl_peserta_kelompok`.`biaya`) AS `biaya`
FROM `tbl_peserta_kelompok`
WHERE `id_kelompok` = '1'
GROUP BY `tbl_peserta_kelompok`.`id_kelompok`