app/Models/ModelKasSosial.php

SELECT *
FROM `tbl_kas_sosial`
---
    public function AllData()
    {
        return $this->db->table('tbl_kas_sosial')
            ->get()->getResultArray();