app/Models/ModelAdmin.php

    public function ViewSetting()
    {
        return $this->db->table('tbl_setting')
        ->where('id', 1)
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1

    public function AllDataKasMasjid()
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_masjid`
WHERE month(tanggal) = '06'
AND year(tanggal) = '2024'

    public function AllDataKasSosial()
    {
        return $this->db->table('tbl_kas_sosial')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_sosial`
WHERE month(tanggal) = '06'
AND year(tanggal) = '2024'

    public function AllDonasi()
    {
        return $this->db->table('tbl_donasi')
            ->join('tbl_rekening', 'tbl_rekening.id_rekening = tbl_donasi.id_rekening', 'left')
            ->select('tbl_donasi.no_rek as no_rek_pengirim')
            ->select('tbl_donasi.nama_bank as nama_bank_pengirim')
            ->select('tbl_donasi.nama_pengirim')
            ->select('tbl_donasi.jumlah')
            ->select('tbl_donasi.tanggal')
            ->select('tbl_donasi.bukti')
            ->select('tbl_donasi.jenis_donasi')
            ->select('tbl_rekening.no_rek as no_rek_tujuan')
            ->select('tbl_rekening.nama_bank as nama_bank_tujuan')
            ->orderBy('id_donasi', 'DESC')
            ->get()->getResultArray();
---
SELECT `tbl_donasi`.`no_rek` as `no_rek_pengirim`, `tbl_donasi`.`nama_bank` as `nama_bank_pengirim`, `tbl_donasi`.`nama_pengirim`, `tbl_donasi`.`jumlah`, `tbl_donasi`.`tanggal`, `tbl_donasi`.`bukti`, `tbl_donasi`.`jenis_donasi`, `tbl_rekening`.`no_rek` as `no_rek_tujuan`, `tbl_rekening`.`nama_bank` as `nama_bank_tujuan`
FROM `tbl_donasi`
LEFT JOIN `tbl_rekening` ON `tbl_rekening`.`id_rekening` = `tbl_donasi`.`id_rekening`
ORDER BY `id_donasi` DESC