app/Models/ModelLogin.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'gilang@gmail.com'
AND `password` = '123'
---
    public function CekUser($email, $password)
    {
        return $this->db->table('tbl_user')
        ->where('email', $email)
        ->where('password', $password)
        ->get()->getRowArray();