app/Models/ModelHome.php

    public function Agenda()
    {
        return $this->db->table('tbl_agenda')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_agenda`
WHERE month(tanggal) = '06'
AND year(tanggal) = '2024'
ORDER BY `tanggal` ASC

    public function AllDataKelompok()
    {
        return $this->db->table('tbl_kelompok')
            ->join('tbl_tahun', 'tbl_tahun.id_tahun = tbl_kelompok.id_tahun', 'left')
            ->where('tahun_m', date('Y'))
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kelompok`
LEFT JOIN `tbl_tahun` ON `tbl_tahun`.`id_tahun` = `tbl_kelompok`.`id_tahun`
WHERE `tahun_m` = '2024'

    public function AllDataKasMasjid()
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_masjid`
WHERE month(tanggal) = '06'
AND year(tanggal) = '2024'

    public function InsertDonasi($data)
    {
        $this->db->table('tbl_donasi')->insert($data);
---
INSERT INTO `tbl_donasi` (`id_rekening`, `nama_bank`, `no_rek`, `nama_pengirim`, `jumlah`, `jenis_donasi`, `bukti`, `tanggal`) VALUES ('2', 'Bank BRI', '4587-1458-7395-4589', 'Abdul', '200000', 'Sosial', '1718110020_1b4415e5dcb2412273f7.png', '2024-06-11')